{
  "reviews": [
    {
      "author_name": "Prakash Ayyadurai",
      "rating": 5,
      "text": "We just returned from a 6-day family trip to Sri Lanka arranged by Explore Vacations, and I can honestly say it was one of the most memorable holidays we’ve ever had. I’m a doctor from Chennai, and our original vacation plan got cancelled last minute. A friend suggested Sri Lanka and connected us with this amazing company—and that changed everything.From the start, their team understood our needs perfectly. We didn’t even pay anything upfront, but they created a custom plan that suited our family perfectly. The warmth and care shown by Mr. Shermal and his team was something we’ve never experienced with other travel planners. We were welcomed at their Colombo office with homemade sweets and snacks—it felt more like visiting friends than a tour company.Our guide, Mr. Sahan, was a gem—calm, intuitive, and extremely helpful. He never once said no to any of our spontaneous plan changes. Whether it was adding a last-minute trip to Adam’s Peak or avoiding off-season whale watching to save us time and money, he was always on our side, making sure we enjoyed the trip our way.Explore Vacations gave us unique and personal experiences—kite flying at Galle Fort, a private elephant ride, surfing in Weligama, secret waterfall spots, local food joints, and beautiful stays in Weligama, Yala, and Hatton.More than a tour, it felt like a journey arranged by people who genuinely care. If you’re planning a Sri Lanka trip, I highly recommend Explore Vacations—they make magic happen.",
      "relative_time_description": "2 weeks ago",
      "profile_photo_url": "assets/images/default-user.png"
    },
    {
      "author_name": "Tina Sumner",
      "rating": 5,
      "text": "I have had a wonderful 20 days tour in Sri Lanka. I cannot recommend Explore Vacations enough, I booked through Tour radar.\nDespite this being a group tour, I was the only booking, any travelling alone. They still ran the tour, just for me. So much seen and done in this beautiful country. My guide Lionel was awesome and knowledgeable. The company easily reached via WhatsApp before and during trip, with rapid reply times. Brilliant",
      "relative_time_description": "1 month ago",
      "profile_photo_url": "assets/images/default-user.png"
    },
    {
      "author_name": "Karen Conway",
      "rating": 5,
      "text": "Ayubowan! I’m grateful to be writing another review based on our second trip organized by Pathumi at Explore Vacations.It. Was. Amazing. Again.First, we were partnered with one of our favourite human beings - Tharindu - who expertly navigated and guided us for two weeks. He ensured we soaked up as much knowledge, culture, and goodness as possible. His care and concern, kindness and generosity are incredible. Tharindu is one of a kind.Because it was our second trip to Sri Lanka in a short period, Pathumi ensured we saw incredible new sites that showcased the diversity of beautiful Sri Lanka. The hotels she recommended were unique. The locations and food second to none. The care and attention Pathumi put into the organization of our trip made it another impactful adventure.I highly recommend Explore Vacations based on the experience we had with Pathumi and Tharindu. We did not have to worry about any detail at any point during our holiday …. And outside of trip planning/execution, they are wonderful people in general 😊",
      "relative_time_description": "2 Years ago",
      "profile_photo_url": "assets/images/default-user.png"
    },
    {
      "author_name": "Jatin Mistry",
      "rating": 5,
      "text": "We had visited Srilanka in May 2018 for 9 days. We had rented a Car with driver from Explore Vacations. The experience was fantastic and their Service very professional. The Price they offered was reasonable and was all inclusive (petrol, parking, toll, driver night charges all included). The car was in very good condition, and the Driver Mr. Herath was a wonderful person who took very good care of us. He was English speaking, and was well versed with the roads, he knew the local tourist attractions in every location that we visited. He was our tour guide as well ! His driving was very safe and we never had any anxious moments, the entire journey was relaxing. I will highly recommend Explore Vacations to anyone who is visiting Sri Lanka !!",
      "relative_time_description": "7 Years ago",
      "profile_photo_url": "assets/images/default-user.png"
    },
    {
      "author_name": "Ira Opatha",
      "rating": 5,
      "text": "It was a great experience for me and my sisters with Explore vacations when we visited Sri Lanka last month. We were able to go to Kandy, Nuwara Eliya, Ella, Bandarawela, Haputale and so many places with the vehicle we wanted and an experienced, polite, driver who drove us carefully on all those dangerous bends in hill country.We had a fantastic time with Explore Vacations and would not hesitate to recommend them to any one.Thanks again Explore Vacations.",
      "relative_time_description": "3 Months ago",
      "profile_photo_url": "assets/images/default-user.png"
    },
    {
      "author_name": "Yehia Dogheim",
      "rating": 5,
      "text": "Just ended my vacation in Srilanka today. By far one of the best vacations because of this company. Very professional, organized and customer focused. They do know how to explore vacations. Thanks to Sahan our driver for the vacation for his exceptional skills. We really enjoyed our trip with him",
      "relative_time_description": "1 Year ago",
      "profile_photo_url": "assets/images/default-user.png"
    },
    {
      "author_name": "Fallon Pieries",
      "rating": 5,
      "text": "I haven’t been to my home country in more than 10 years and I wanted to see as much as I could. Explore Vacations definitely made sure that happened. From the hotels to the amazing sights we got to see it was a super experience! I would highly recommend.",
      "relative_time_description": "1 Year ago",
      "profile_photo_url": "assets/images/default-user.png"
    }
  ]
}
